{"sections":[{"number":1,"complete":false,"content":"2 \r\nInfrastructure and Database Migration to Microsoft Azure\r\nSpecialization \r\nProgram  guide, audit checklist, and FAQ \r\nV1.5 \r\nValid August 12 – December 31, 2024 "},{"number":2,"complete":false,"content":"2 \r\nProgram updates and announcements \r\nModule B – June 12, 2024\r\nThe V1.5 checklist is required August 12, 2024. The following are control changes:\r\n• Control 1.1, Certifications: Partners holding the PostgreSQL Professional Certification (V13) will be able\r\nto meet this control evidence until Nov 2025, when Microsoft will no longer accept this certification.\r\nThis is replaced by PostgreSQL Advanced v16 Certification V2.\r\n• Control 5.2 Post Deployment Documentation has updated evidence requirements for clarity.\r\n• Partners must continue to check with Azure Partner Specializations \u003CazureAS@microsoft.com\u003E to\r\nqualify for the alternate pathway checklist.\r\nModule A – June 12, 2024\r\nThe new Module A checklist is available for preview and will be required August 12, 2024.\r\nThese are the changes made to the controls:\r\n• Control 1.1 Cloud Adoption Business Strategy now refers to FinOps rather than Economics and has provided an\r\nupdated template link for a FinOps Assessment\r\n• Control 2.1 Cloud Adoption Plan has provided updated evidence clarification\r\n• Control 3.1 Repeatable Deployment has provided updated control clarification and provided updated\r\nlinks to templates mentioned\r\n• Control 3.1 Repeatable Deployment – A special Evidence Note for Analytics on Azure specialization\r\ndeployments and Data Warehouse Migration to Azure specialization deployments only. If no Identity\r\nor Networking components are deployed in the Azure Landing Zone, a documented focus on Resource\r\norganization attributes is sufficient to pass this control\r\n• Control 4.1 Governance Tooling has provided an updated link to current Governance tools\r\n• Control 5.1 Operations Management Tooling for Analytics on Azure specialization deployments and Data\r\nWarehouse Migration to Azure specialization deployments only: If no Operations Management Tooling is\r\ndeployed, this control may be skipped\r\nPlease note the price schedule July 1, 2024\r\nModule B – Mar 13, 2024\r\nThe V1.4 checklist is released. For qualified, renewing partners only, the checklist has been updated to\r\ninclude an alternate evidence path in addition to the core audit, that includes Windows and SQL.\r\nMicrosoft will alert you if you qualify for this checklist version, this is not a self-nomination process.\r\n• Both checklists now require 2 unique customers for demonstrated evidence. \r\nModule B – Jan 1, 2024\r\nThe V1.3 checklist is now published and required. Changes from V1.21 include Controls 2.1, 3.1, 3.2,\r\n4.4, 5.1, and 5.2. In these:\r\n• Oracle can be used in migration scenarios three (3) and four (4) for the listed controls as the\r\n“source” database and evidence of the partner’s ability to migrate a customer to the Azure DB\r\nplatform. Oracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify for these scenarios.  "},{"number":3,"complete":false,"content":"3 \r\nModule B – Dec 1, 2023\r\nThe V1.3 Infra and DB Migration to Azure checklist was made available for partners in preview. Two (2)\r\ncustomer projects rather than three (3) are now required. All four (4) specific migration scenarios must be\r\ndemonstrated. This will be required Jan 1, 2024. \r\nModule A – Oct 1, 2023\r\nAzure Active Directory has been renamed Microsoft Entra ID \r\nModule B - October 24, 2023\r\nControl 1.1 Certifications. The control was clarified to convey that the partner must be a member of either\r\nthe Red Hat Business Partner Program or the SUSE One Partner Program, or they must have two (2) full-time\r\nemployees who have at least one (1) of the qualifying certifications verified by certifying agencies. \r\nAugust 28, 2023\r\nThe Microsoft Cloud Partner Program changed its name to the Microsoft AI Cloud Partner Program,\r\neffective immediately. \r\nModule B - June 5, 2023\r\nV1.2 Infrastructure and Database Migration to Microsoft Azure Specialization checklist is published.\r\nThis checklist version is required for audits during July 5, 2023- Jan 2, 2024\r\nControl 3.1 Solution Design has added security products such as Azure security services, Microsoft 365 security,\r\nand Microsoft Defender for Cloud as evidence for this control.\r\nModule B - Feb 17, 2023\r\nV1.1 in Control 1.1 adds a new verification source for third party certifications; Verify a Red Hat Certified\r\nProfessional | redhat.com can be used for RedHat validation. \r\nModule B – Jan 9, 2023\r\nEffective Jan 9, 2023, partners with active enrollments for either or both of the Linux and Open-Source\r\nDatabase Migration to Microsoft Azure Specialization or the Windows Server and SQL Server Migration\r\nto Microsoft Azure Specialization are auto enrolled in (or “grandfathered in”) to the Infra and\r\nDatabase Migration to Microsoft Azure Specialization. Upon a partner’s respective anniversary dates, a\r\npartner will need to meet the requirements of the new Infra and Database Migration to Microsoft Azure\r\nSpecialization, including the specialization’s audit checklist. For more information on this, please visit Partner\r\nCenter.\r\nModule B - Dec 9, 2022\r\nThe V1.0 PREVIEW of Infra and Database Migration to Microsoft Azure Specialization was made available\r\nfor partners. It replaced several legacy Azure specializations:\r\nAs of Jan 9, 2023, the new Infra and Database Migration to Microsoft Azure Specialization and its audit checklist\r\nreplaces both the V2.1 Windows Server and SQL Server Migration to Microsoft Azure Specialization audit\r\nchecklist and the V2.1 Linux and Open-Source Database Migration to Microsoft Azure Specialization audit\r\nchecklist.\r\nModule B - Oct 3, 2022\r\nMicrosoft retired partner Gold Cloud competency, the aligned Solutions Partner designation is now required.\r\nFor this specialization, your organization must have an active Solutions Partner for Data \u0026 AI (Azure) or a Solutions\r\nPartner for Infrastructure (Azure) designation. "},{"number":4,"complete":false,"content":"4 \r\nModule A - July1, 2022\r\nChecklist updates published May 2, 2022, in preview for Module A checklist are now required. In Control 2.2,\r\na new required Skilling Plan has been added to the checklist and is now required.\r\nModule B - May 2, 2022\r\n• Guidance for the definition of Proof of Concept and Pilots added to the FAQ.\r\n• Preview updates to Module A were made available, these are required July 1, 2022 \r\nJan 1, 2022\r\nGuidance and FAQ Updates "},{"number":5,"complete":false,"content":"5 \r\nContents\r\nInfra and DB Migration to Microsoft Azure Specialization Program Overview ..................................................... 5\r\nHow to apply ......................................................................................................................................................................... 6\r\nNDAs for the audit ................................................................................................................................................................ 7\r\nPayment terms and conditions ......................................................................................................................................... 7\r\nAudit blueprint ...................................................................................................................................................................... 7\r\nAudit roles ............................................................................................................................................................................... 8\r\nAudit Process: High-level overview .................................................................................................................................. 8\r\nAudit Process: Details .......................................................................................................................................................... 9\r\nAudit preparation best practices and resources .......................................................................................................... 11\r\nAudit checklists .................................................................................................................................................................... 12\r\nPartner FAQ ..........................................................................................................................................................................36 "},{"number":6,"complete":false,"content":"6 \r\nInfra and Database Migration to Microsoft Azure Specialization Program\r\nOverview\r\nThis document defines the requirements to earn the Infra and Database Migration to Microsoft Azure\r\nSpecialization. It also provides further requirements, guidelines, and an audit checklist for the associated audit\r\nthat is required to earn this Azure specialization. \r\nThe Infra and Database Migration to Microsoft Azure Specialization is designed for partners to demonstrate\r\ndeep knowledge, experience, and success in planning and migrating their customer’s infrastructure and\r\ndatabase workloads to Azure. Partners with demonstrated expertise across both Windows Server and SQL\r\nServer and across Linux and Open-Source database migration to Microsoft Azure may apply.\r\nThe Infra and Database Migration to Microsoft Azure Specialization allows partners with an active Solutions\r\nPartner for Infrastructure designation or Solutions Partner for Data \u0026 AI designation to demonstrate their\r\ncapabilities, build stronger connections with customers and differentiate their organizations in Infrastructure\r\nand Database migration. \r\nPartners who meet the comprehensive requirements to earn an Azure Specialization, receive a customer-\r\nfacing label they can display, badge and a business profile in Microsoft AppSource partner gallery.\r\nIn AppSource, access to specific Microsoft go-to-market programs is prioritized in customer searches\r\nto help drive new business. Partners can also generate a certified letter from Microsoft that verifies\r\nthe Azure specializations that they have earned. For these reasons, this opportunity is available only\r\nto partners that meet additional, stringent requirements. \r\nPlease note: This specialization requires 3rd party certifications to proceed to audit unless you are approved\r\nfor the alternate Module B pathway option. These certifications are found in Module B Control 1.1.\r\nHow to apply\r\nOnly a Microsoft AI Cloud Account Administrator or a Global Administrator of an organization’s Microsoft\r\npartner account can submit an application for the Azure specialization on behalf of the organization.\r\nPartners with the appropriate role and access permissions can apply. To do so, they sign into their Partner\r\nCenter account. On the left pane, select Azure under the Specialization section. Toggle to the specialization that\r\nyou wish to apply for by using the drop-down menu at the top of the page. "},{"number":7,"complete":false,"content":"7 \r\nNDAs for the audit \r\nAuditors comply with requests from partners to sign a direct NDA. All ISSI auditors are under a\r\nnondisclosure agreement (NDA) with Microsoft. If a partner would like an NDA to be signed directly\r\nbetween ISSI and the partner organization for purposes of the audit, one can be provided by the partner\r\nduring the audit scheduling process to ISSI. ISSI will sign and return it. \r\nPayment terms and conditions\r\nPricing schedule as of July 1, 2024\r\nModule B Audit: $2,400 USD \r\nModule A\u002BB Audits: $3,600 USD\r\nA Gap Review Meeting is included with each Module audit.\r\nPayment terms \r\nThe cost of the audit is payable in full to the audit company and must be settled before the audit begins.\r\nFailure to pay will result in cancellation of the audit.\r\nProgram status term\r\nWhen a partner meets all prerequisite requirements shown in Partner Center and Microsoft receives a valid\r\nPass Report from the third-party audit company, the partner will be awarded the Infra and Database\r\nMigration Azure Specialization for one (1) calendar year.\r\nThe status and the Infra and Database Migration Azure Specialization label can be used only by the\r\norganization (determined by Partner Center MPNPGA ID account) and any associated locations\r\n(determined by MPN PLA ID) that met all requirements and passed the audit. Any subsidiary or affiliated\r\norganizations represented by separate Partner Center accounts (MPN PGA ID) may not advertise the status\r\nor display the associated label.\r\nAudit blueprint\r\nAudits are evidence-based. During the audit, partners will be expected to present evidence they have\r\nmet the specific requirements on the checklist. This involves providing the auditor with access to live\r\ndemonstrations, documents, and SME personnel to demonstrate compliance with checklist requirements.\r\nThe audit checklist will be updated to stay current with technology and market changes, and the\r\naudit is conducted by an independent, third-party auditor.\r\nThe following is included in the audit blueprint:\r\n1. Audit Roles\r\n2. Audit Process: High level overview\r\n3. Audit Process: Details\r\n4. Audit Best Practices and Resources "},{"number":8,"complete":false,"content":"8 \r\nAudit roles\r\nRole of the auditor \r\nThe auditor reviews submitted evidence and objectively assesses whether the evidence provided by the partner\r\nsatisfies the audit checklist requirements. The auditor selects and evaluates evidence, based on samples of the\r\ninformation available from live systems. The appropriate use of such sampling is closely related to the confidence\r\nthat can be placed in the audit conclusions. All ISSI auditors are under a non-disclosure agreement (NDA) with\r\nMicrosoft. Auditors will also comply with requests from partners to sign a direct NDA. \r\nRole of the partner \r\nThe partner must provide objective evidence that satisfies the auditor for all checklist items. It is the responsibility of\r\nthe partner to have reviewed all check-list items prior to the audit, to have collected all necessary documentation and\r\nevidence, and to have ensured that the right subject matter experts are available to discuss and show systems, as\r\nappropriate. All audit evidence must be reproducible and verifiable.\r\nRole of the Microsoft Partner Development Manager \r\nFor partners that have an assigned Microsoft Partner Development Manager (PDM), the PDM is responsible for ensuring\r\nthat the partner fully understands the requirements prior to applying for the audit. The PDM may attend the optional\r\nconsulting engagements that ISSI offers, but the PDM and other Microsoft FTEs may not attend the audit. \r\nAudit Process: High-level overview \r\nStep Action Responsibility\r\n1 Review: Specialization requirements in Partner Center. Review audit\r\nchecklists in the specialization and begin to prepare the necessary\r\nevidence with personnel for an evidence-based audit. Recommended:\r\nBefore you apply, review the specific audit checklist thoroughly and\r\nconfirm SME personnel required for the audit date.\r\nPartner\r\n2 Meet the prerequisites and apply for the audit: In the initial\r\napplication phase, applications are submitted in two (2) stages: \r\n1. Prerequisite requirements (see Partner Center for details)\r\n2. Audit\r\nDo not start the application process unless you are ready to undertake\r\nthe audit. Assess your firm’s ability to complete the audit, including\r\nconsiderations for readiness, employee availability, and holidays.\r\nPartner\r\n3 Validate: The partner meets all requirements prior to audit. Microsoft \r\nConfirmed by Microsoft: Microsoft confirms with the third-party audit\r\ncompany that the partner is eligible for audit.\r\nMicrosoft\r\n4 \r\n5 Schedule with partner: The auditor will schedule within two (2) business\r\ndays.\r\nAuditor (with\r\npartner) "},{"number":9,"complete":false,"content":"9 \r\n6 Conduct the audit: Within thirty (30) calendar days of the approval for\r\naudit.\r\nAuditor\r\n7 Provide a Gap Report: If applicable, to the partner within two (2)\r\nbusiness days of the completed audit, listing any Open Action Items. *\r\nAuditor\r\n8 Acknowledge Gap Report receipt and schedule meeting: Within two\r\n(2) business days of receiving the Gap Report, the partner acknowledges\r\nreceipt of the report and schedules a Gap Review Meeting. Partners can\r\nbegin immediate remediation of open items.\r\nPartner\r\n9 Complete the meeting: Within fifteen (15) calendar days of receiving\r\nthe Gap Report, the partner schedules and completes the Gap Review\r\nMeeting with the auditor to provide evidence and address any Open\r\nAction Items. *\r\nAuditor (with\r\npartner)\r\n10 Issue Final Report: To the partner within five (5) business days. Notify\r\nMicrosoft of audit Pass or No Pass result.\r\nAuditor\r\n11 Notify partner: About program status within two (2) business days. Microsoft\r\n*These steps will be skipped if the partner has no Open Action Items after the audit. \r\nAudit Process: Details\r\nMicrosoft uses an independent third-party audit company, Information Security Systems International,\r\nLLC (ISSI), to schedule and conduct Azure specialization audits. After the audit date has been confirmed,\r\nISSI will provide an agenda for the partner. The duration of an audit is four (4) hours for Module B\r\nworkloads and eight (8) hours for Module A\u002BB audits combined, depending upon the scope of the audit. \r\nDuring the audit, the partner must provide access to the appropriate personnel who can discuss and\r\ndisclose evidence that demonstrates compliance with program requirements. We highly recommend that\r\nsubject matter experts for each section attend as well as a person who is familiar with the entire audit. \r\nOn the day of the audit, the partner must be prepared to provide the auditor with access to live\r\ndemonstrations, documents, and personnel, as necessary to demonstrate compliance with the\r\nrequirements. During the audit, the auditor will seek to verify that the partner’s evidence has addressed\r\nall required audit checklist items satisfactorily.\r\nA note on audit checklist effective dates: Partners are audited against the checklist items that are active on\r\nthe date of their remote audit, not the date they apply. Audits are updated twice annually. The\r\npartner application or renewal date has no bearing on the version of the checklist that is used for the\r\naudit. "},{"number":10,"complete":false,"content":"10 \r\nThe audit can produce either of two (2) outcomes:\r\n1. The partner passes the audit.\r\n• The auditor will present a brief synopsis of the audit. This will include identifying\r\nobserved strengths and opportunities for improvement.\r\n• The auditor will provide a Final Report to the partner.\r\n• The auditor will notify Microsoft. \r\n2. The partner does not satisfy all checklist items during the audit.\r\n• The auditor will present a brief synopsis of the audit at the end of the day, including\r\nobserved strengths and Open Action Items, as outlined in the Gap Report, within\r\ntwo\r\n(2) business days.\r\n• The partner will acknowledge receipt of the Gap Report within two (2) business days.\r\n• The partner will move into the Gap Review phase and schedule their Gap Review Meeting\r\nwithin fifteen (15) calendar days. \r\nThe Gap Review \r\nIf the partner does not, to the auditor’s satisfaction, provide evidence that meets the required scores\r\nacross all audit categories during the audit, the partner will move into a Gap Review. A Gap Review is\r\npart of the audit and completes the process.\r\nWithin two (2) business days after the audit, the partner will receive a Gap Report, which details any\r\nOpen Action Items and the outstanding required evidence. It is suggested to begin remediation of any\r\nopen action items as soon as possible following the audit.\r\nThe partner then has two (2) business days to acknowledge receipt of the Gap Report and schedule a\r\nGap Review Meeting. The Gap Review Meeting is conducted with the auditor over the partner’s virtual\r\nconference platform of choice. The meeting must take place within fifteen (15) calendar days of when the\r\nGap Report was sent, and it may last no longer than one (1) hour. During the Gap Review Meeting the\r\npartner must present evidence that addresses any and all Open Action Items.\r\nThe Gap Review Meeting can produce either of two (2) outcomes:\r\n1. The partner resolves all Open Action Items.\r\n• The auditor confirms that the partner has provided the required evidence.\r\n• The auditor provides a Final Report for the partner.\r\n• The auditor notifies Microsoft about the outcome (subject to Auditor Terms and Conditions). \r\n2. The partner does not resolve all Open Action Items.\r\n• The auditor presents a brief synopsis of the audit, including missed items.\r\n• The partner receives a Final Report that details the missed items.\r\n• The auditor notifies Microsoft about the outcome (subject to Audit Terms and Conditions). \r\nIf the partner is still unable to provide satisfactory evidence to the auditor during their Gap Review Meeting,\r\nthe partner will be deemed to have failed the audit. Partners that still want to earn this Azure specialization will\r\nneed to begin the application process again. "},{"number":11,"complete":false,"content":"11 \r\nCompletion of the audit\r\nThe audit process concludes when ISSI issues the Final Report after the audit or after the Gap Review. Partners will\r\nreceive a Pass or No Pass result upon completion of the audit process. \r\nA Pass result satisfies the audit requirement for this Azure specialization for two (2) years. A “No Pass” result\r\nis generated when a partner fails or withdraws from the audit. When a No Pass result is entered into Partner\r\nCenter, you will see your status as “Audit Failed” in your dashboard. This status will reset within one week to\r\n“Not Enrolled,” allowing you to reapply. Contact Partner Center Support if needed. \r\nAudit preparation best practices and resources\r\nPartners should ensure that the audit checklist has been thoroughly read in advance of the audit.\r\n• Partners should ensure that all partner stakeholders involved in the audit have a copy of the audit\r\nchecklist and are confirmed for the date and time duration of the audit\r\n• A lead stakeholder who knows the entire process must be available for the length of the audit\r\n• Partners should confirm that they have access granted for the auditors, and files and tools are readily\r\navailable during the audit exhibits \r\nStakeholder SME attendance in the audit \r\nStakeholders who can best address the relevant section should be available for the audit. However, please\r\nmake sure that a stakeholder who knows the entire process is available for the duration of the audit.\r\nAuditors often probe for more information\r\nThe auditor probes for more information to ensure that mature and repeatable processes are in place with the\r\npartner and that they are established, effective, and efficient. The auditor is looking to see how a document\r\nwas created, where it is located, and what source materials were used to create the document. By probing for\r\nmore information, the auditor evaluates and validates that the partner is operating at an advanced level. This\r\ncan only be done by questioning during the audit. This approach is explained to the partner during the\r\nopening meeting.\r\nAcceptable evidence: Excerpts, exhibit file formats and use of PowerPoints \r\nPowerPoints are a common and accepted format for presenting a high-level overview of a partner’s systems.\r\nHowever, please also be prepared to present live demonstrations from source files so that the auditor may\r\nconfirm that the systems in place are mature and effective. Excerpts can be used to communicate the high-\r\nlevel overview, however, as sole evidence these are not acceptable. Source documents must also be\r\npresented. "},{"number":12,"complete":false,"content":"12 \r\nAdditional resources: Two optional audit preparation offers from the auditing firm *\r\nTo ensure objectivity, consulting auditors and auditors conducting the actual audits are different ISSI auditors.\r\n1. Partners can participate in a paid optional, one (1)-hour, live Audit Process \u0026 Controls Overview\r\nsession provided by ISSI. This session provides a high-level overview of key aspects of the Azure\r\nspecialization audit process. Partners work directly with ISSI to schedule this remote session (via online\r\nweb conference). For more information about this session, see Azure Specialization - Audit Process and\r\nControls Overview\r\n2. ISSI also provides optional extensive, paid, in-depth consulting engagements to help partners prepare for their\r\nAzure specialization audit. Partners work directly with ISSI to schedule this remote session (via online web\r\nconference). For more information about this type of in-depth engagement, see Azure Specialization\r\nConsulting Offer https://issi-inc.com/az-advspeconsulting/\r\n*Please note that there is a cost associated with both ISSI’s Consulting and the Process and Controls Overview. These can be\r\nscheduled at any time with ISSI; however, Microsoft recommends the partner does not schedule these during the actual audit\r\nbut instead if chosen, work these into the planning timeline before the audit is scheduled. \r\nAudit checklists\r\nThe Infra and Database Migration to Microsoft Azure Specialization checklist contains two (2) modules, Module A,\r\nCloud Foundation and Module B: The Infra and Database Migration to Microsoft Azure Specialization workload. \r\nModule A, Cloud Foundation is required for multiple Azure specializations. Module A evaluates the use of\r\na consistent methodology and process for Azure adoption that is aligned with customers’ expected\r\noutcomes, spanning the entire cloud adoption lifecycle. Module A is part of the Module B specialization\r\naudit package, and as a requirement must be renewed by audit for all Azure specializations.\r\nTo complete or renew Module A, the partner needs to pass all controls in Module A by providing the\r\nspecified evidence or providing evidence of a recent (within two years) Module A\u002BB Pass result. The\r\nrelevant date for each partner is the Module B Anniversary Date (AD) shown in Partner Center. \r\nTo waiver out of Module A, the partner must provide evidence of a recent (within two years) Pass result for\r\nan applicable A\u002BB audit or a Pass result for the AEMSP Control 3.A within the last year. \r\nModule A waivers:\r\nAll Azure Specializations: When applying to renew subsequent Azure specializations, a previous Module A\r\n\u002BB audit Pass result will satisfy the requirements for Module A if the result has been within two (2) years\r\nand is on the same Module A version. (Module A updates every two years in July). Partners who have\r\npassed an A\u002BB Azure specialization audit within the last two years have satisfied the requirements for\r\nModule A in all Module A\u002BB Azure specialization audits, unless otherwise noted. The relevant Module B\r\nAnniversary Date (AD) is shown in Partner Center.\r\nSpecial note: Partners who have passed a Module B Azure specialization audit before July 1, 2021, and\r\nspecifically for the Analytics on Microsoft Azure specialization before Oct 1, 2021, have likely not passed the\r\nModule A audit and will need to do so to qualify for an Azure Module B specialization audit.  "},{"number":13,"complete":false,"content":"13 \r\nAEMSP: Partners who have passed Azure Expert MSP V1.9 and later Module 3.0 (in Full and Progress audits)\r\nhave satisfied the requirements for Module A in all Module A\u002BB Azure specialization audits, unless\r\notherwise noted. AEMSP Partners audit yearly to stay enrolled, and Module 3.A Cloud Adoption Framework\r\nis also a yearly control requirement. \r\nSpecial note: Partners who sequentially waiver out of Module A in multiple Module A\u002BB audits and then\r\nsubsequently waiver out of AEMSP Module 3.A within a two-year timeline will likely be required to take a\r\nModule A audit at Module A\u002BB renewal. \r\nIf there are questions regarding a potential waiver for Module A, reach out to the Azure Partner Specializations\r\n\u003CazureAS@microsoft.com\u003E \r\nModule B, The Infra and Database Migration to Microsoft Azure Specialization workload module\r\nvalidates that the partner has adopted robust processes to ensure customer success across all phases of\r\ndeploying Infra and Database Migration solutions, from the assessment phase to design, pilot,\r\nimplementation, and post-implementation phases. Review the following audit checklist tables for more\r\ndetails about each control phase and to learn how the partner will be evaluated for an audit. The same\r\ncustomers may be used for Module A \u0026 B. The estimated length of both modules together is eight (8)\r\nhours.\r\nAlternate Pathway Note: You may qualify for an alternate audit checklist using alternate evidence scenarios if\r\nMicrosoft communicates this is available to you. To inquire ask at Azure Partner Specializations\r\n\u003CazureAS@microsoft.com\u003E\r\nModule A: Cloud Foundation\r\n1. Strategy\r\n2. Plan\r\n3. Environment readiness and Azure landing zone\r\n4. Governance\r\n5. Manage \r\nModule B: Infra and Database Migration to Microsoft Azure workload \r\n1. Third- party certifications\r\n2. Assess\r\n3. Design\r\n4. Deployment\r\n5. Review and Release for operations \r\nTo pass the audit, the partner must complete all audit checklist items.\r\nModule A, Cloud Foundation is required for multiple Azure specializations. To complete Module A: Cloud\r\nFoundation, the partner needs to pass all controls in Module A by providing the specified evidence.\r\nAlternatively, the partner may present evidence of a previous pass result from Module A or from another\r\nAzure specialization audit conducted on V2.0 or later. "},{"number":14,"complete":false,"content":"14 \r\nModule B, The Infra and Database Migration to Microsoft Azure Specialization workload. Each control has one\r\n(1) or more requirements and requires evidence the partner must provide for the auditor. Both the\r\nrequirements and the required evidence are defined in the following tables. For some controls, a reference\r\ncustomer or customer evidence is the documentation requested.\r\nEach customer case does not have to include all four (4) scenarios. A single project may satisfy multiple\r\nscenarios.\r\n1. Migration of Infra (Windows Server) Applications to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL to Azure (can include Arc-enabled SQL Managed Instance (MI)\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure \r\nFor Module B, an alternate pathway:\r\nEach customer case does not have to include all scenarios. A single project may satisfy both scenarios. \r\n1. Migration of Infra (Windows Server) Applications to Azure\r\n2. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed Instance (MI) \r\nFor audit evidence relating to customer engagements, the partner can use a customer case study and reference it\r\nmultiple times. The same or different customers can be used for Modules A \u0026 B if they demonstrate requirements. "},{"number":15,"complete":false,"content":"15 \r\nModule A: Cloud Foundation control checklist \r\n1.0 Strategy and FinOps\r\nThe partner must have a defined approach for helping their customer evaluate and define a cloud\r\nadoption strategy beyond an individual asset (app, VM, or data).\r\nRequirement\r\n1.1 Cloud Adoption Business Strategy\r\nThe partner must have a defined process that captures the data-driven business strategies\r\nbeing used to guide customer decisions. The process should include, at minimum, the\r\nfollowing:\r\n1. A strategy review that captures the customer’s business needs and the problems the\r\ncustomer is trying to solve.\r\n2. Personalized recommendations from the partner for the customers’ business\r\nstrategies.\r\nRequired evidence:\r\nA Report, Presentation, or Documented Plan that captures strategic inputs and decisions\r\nfor two (2) unique customers, and that demonstrate the Azure Cloud Adoption Business\r\ndecisions for the Azure Cloud Framework, by using the Cloud Adoption Strategy Evaluator\r\n(CASE) assessment output. \r\nThese projects should have been completed in the past twelve (12) months. The projects\r\nmust be aligned with the above-described processes 1 and 2 and highlight both customer\r\nBusiness and FinOps (Financial) outcomes. \r\nFor an example, see the Cloud Adoption Strategy Evaluator,  Strategy and plan templates\r\nin the Cloud Adoption Framework for Azure, and especially the FinOps Assessment best\r\npractices in Build. \r\n2.0 Plan\r\nThe partner must have a consistent approach to planning for cloud adoption that is based on the strategy\r\noutlined in the preceding section.\r\nRequirement "},{"number":16,"complete":false,"content":"16 \r\n2.1 Cloud Adoption Plan\r\nThe partner must have a process and approach for planning and tracking the\r\ncompletion of cloud adoption projects.\r\nRequired evidence:\r\nThe partner must provide evidence of their capability for process and approach to\r\nplanning and completion with examples of two (2) unique customer projects that were\r\ncompleted in the past twelve (12) months.\r\nAcceptable evidence will include at least one (1) of the following for each customer:\r\n• Azure DevOps backlog OR\r\n• Tools for project planning and tracking used by the partner OR\r\n• Cloud Adoption Plan Generator output using the Azure Cloud Adoption Framework  \r\n2.2 Plan for Skilling\r\nWhen customers adopt the cloud, their existing technical staff will need a variety of new\r\nskills to aid in making technical decisions and to support the new cloud implementations.\r\nTo ensure the long- term success of the customer, the partner must document a skilling\r\nplan to prepare the customer’s technical staff.\r\nThe Partner must document a list of key customer technical roles expected to require\r\nnew skills such as, but not limited to, IT Admins, IT Governance, IT Operations, and\r\nIT Security.\r\nThe documentation must include:\r\n1. A description of the new skills the technical roles will need to achieve to\r\nsuccessfully manage the new environment.\r\n2. Resources the customer can leverage when training their technical employees\r\nsuch as Microsoft learning paths, technical certifications, or other comparable\r\nresources. \r\nFor guidance, review Microsoft docs Azure Cloud Adoption Framework How to build\r\na skilling readiness plan.\r\nRequired evidence:\r\nThe partner must provide a skilling plan for at least two (2) unique customer\r\nengagements completed within the last twelve (12) months. The two (2) skilling plans\r\ndocumented can include a customer-facing presentation, planning documents, post\r\ndeployment documentation or similar plan documentation.  \r\n3.0 Environment Readiness and Azure Landing Zone\r\nThe partner must be able to demonstrate that the following design areas are addressed through their\r\napproach to landing zone implementation.\r\nRequirement "},{"number":17,"complete":false,"content":"17 \r\n3.1 Repeatable Deployment\r\nThe partner must demonstrate adherence to Azure landing zone (ALZ) design areas through a\r\nrepeatable deployment. The deployment should configure, at minimum, the following\r\nidentity, network, and resource organization attributes:\r\n• Identity\r\no Adoption of identity management solutions, such as Microsoft Entra ID\r\n(formerly Azure Active Directory) or equivalent\r\n• Networking architecture design (topology)\r\no Define an Azure network topology - Cloud Adoption Framework | Microsoft Docs\r\no Application of hybrid architectures that use Azure ExpressRoute, VPN\r\nGateway, or equivalent services for connecting local datacenters to\r\nAzure\r\n• Resource organization\r\no Implementation of tagging and naming standards during the project \r\nThe partner must demonstrate which of the following approaches they used when they\r\ndeployed Azure landing zones for two (2) unique customers:\r\n1. Start small and expand: Azure landing zone does not deploy\r\ngovernance or operations configurations, which are addressed later\r\nin the implementation.\r\n2. Full Azure landing zone (ALZ) conceptual architecture: Azure landing zones\r\nimplement standard approach to the configuration of governance and\r\noperations tools prior to implementation.\r\n3. Alternative approach: If the partner follows a proprietary approach or a mixture\r\nof the two (2) approaches above, the partner must clearly articulate their\r\napproach to environment configuration.\r\n4. Brownfield scenario: The partner’s customer has a landing zone that does not\r\nfollow best practices, and an update is required to follow best practices in the\r\nCloud Adoption Framework.\r\nRequired evidence:\r\nThe partner must provide evidence of a repeatable deployment they used to create landing\r\nzones, aligned to the Azure landing zone (ALZ) conceptual architecture, deployed to two (2)\r\nunique customer environments using Bicep or Terraform modules, and ARM (AZURE Resource\r\nManager) templates to automatically deploy the environment configuration. \r\nIf a customer deviates from the specified architecture, the partner must demonstrate the\r\ncustomer requirements to justify the deviation. \r\nThe provided template can be pulled directly from the Cloud Adoption Framework Landing zone\r\nimplementation options, or it can be based on the partner’s own IP (Intellectual Property). \r\nIn either case, the output evidence must demonstrate the configuration of the identity, network, "},{"number":18,"complete":false,"content":"18 \r\nand resource organization, as described earlier above. \r\nSpecial Evidence Note:\r\nFor Analytics on Azure specialization deployments and Data Warehouse Migration to Azure\r\nspecialization deployments only: If no Identity or Networking components are deployed in the\r\nAzure Landing Zone, a documented focus on Resource organization attributes is sufficient to\r\npass this control.\r\n4.0 Governance\r\nThe partner must demonstrate their customer’s role in governing cloud-based solutions and the Azure\r\ntools they use to facilitate any governance requirements their customer might have today or in the\r\nfuture.\r\nRequirement\r\n4.1 Governance Tooling\r\nThe partner must demonstrate the ability to deploy the required governance tools for two (2)\r\nunique customer projects.\r\nRequired evidence:\r\nThe partner must demonstrate the use of Azure Policy to provide controls to govern the\r\nenvironment for two (2) unique customers with Azure projects that were completed in the\r\npast twelve (12) months. See governance tools for templates.\r\n5.0 Manage\r\nThe partner must demonstrate that they have set up their customers for operational success after the\r\ndeployment is completed. All partners have a role in setting up operations management, even if they do\r\nnot provide long-term managed services.\r\nRequirement\r\n5.1 Operations Management Tooling\r\nThe partner must demonstrate the use of Azure products or equivalent to help their\r\ncustomer and/or managed service provider operate the environment after deployment.\r\nRequired evidence:\r\nThe partner must demonstrate the deployment of at least one (1) of the following Azure\r\nproducts or third-party equivalents: Azure Monitor, Azure Automation, or Azure Backup/Site\r\nRecovery, for two (2) unique customers with projects that were completed in the past twelve\r\n(12) months. \r\nSpecial Evidence Note:\r\nFor Analytics on Azure specialization deployments and Data Warehouse Migration to Azure\r\nspecialization deployments only: If no Operations Management Tooling is deployed, this control\r\nmay be skipped. "},{"number":19,"complete":false,"content":"19 \r\nModule B: Infrastructure and Database Migration to Microsoft Azure\r\nSpecialization \r\n1.0 Third-party Certifications required\r\nThe partner’s resources are highly knowledgeable in open-source technologies.\r\nRequirement\r\n1.1 Certification required for Infra and Database Migration to Azure standard pathway\r\nThe partner must be a member of either the Red Hat Business Partner Program\r\nOR the SUSE One Partner Program\r\nOR they must have two (2) full-time employees who each have one (1) of the following\r\ncertifications:\r\n• Linux Foundation Certified Sys Admin\r\n• Linux Foundation Certified Engineer\r\n• LPIC-1 Certified Linux Administrator\r\n• LPIC-2 Certified Linux Engineer\r\n• Linux Professional Institute DevOps Tools Engineer\r\n• PostgreSQL Professional Certification (V13 until Nov. 2025)\r\n• PostgreSQL Advanced v16 Certification V2\r\n• RedHat Certified System Administrator (RHCSA)\r\n• RedHat Certified Engineer (RHCE)\r\n• Red Hat Certified Architect (RHCA)\r\n• SUSE Enterprise Architect (SEA)\r\n• SUSE Certified Engineer (SCE)\r\n• SUSE Certified Administrator (SCA\u0026 SCA\u002B)\r\n• EDB Professional Certification \r\nRequired Evidence:\r\nCertifications must be verified through one (1) of the following below or show that the partner\r\nis listed as a partner in the Red Hat Partner Program Directory or the SUSE One Partner\r\ndirectory. If the partner is not listed in the Red Hat or SUSE Program directory, two (2) FTEs\r\nmust verify one of the above certifications by:\r\n• The Linux Foundation\r\n• Linux Professional Institute (LPI)\r\n• Verify a RedHat Certified Professional | redhat.com\r\n• Red Hat CCSP Program \r\n• Provide the individual’s profile badge as a PostgreSQL Professional on the\r\nindividual’s LinkedIn or other social media pages with this competency or\r\ncertification.\r\n• The partner must also provide evidence that the certified personnel are currently full-\r\ntime employees. "},{"number":20,"complete":false,"content":"20 \r\n2.0 Assess\r\nThe partner must have a consistent approach for assessing customer requirements for the workload.\r\nRequirements\r\n2.1 Workload Assessment\r\nThe partner must demonstrate how they assess each workload prior to migration to\r\nensure that adequate pre-migration or pre-deployment planning and sizing were\r\nperformed.\r\nThe assessment must include mapping that shows the dependencies upstream from the\r\nresources that will be migrated. It must also show:\r\n• The infrastructure, data volumes and database sizes to be migrated.\r\n• The migration timeline and approach.\r\n• The migration risk assessment.\r\n• Backup and disaster recovery for existing workloads.\r\n• Licensing and cost management requirements.\r\n• Documentation of the customer’s existing identity implementation on Azure, gaps\r\nidentification, and best practices recommendations. \r\nThe partner must provide evidence for all four (4) of the following scenarios, across a\r\nminimum of two (2) unique customer projects completed within the past twelve (12)\r\nmonths. Each customer case does not have to include all four (4) scenarios, a single project\r\nmay satisfy multiple scenarios.\r\n1. Migration of Infra (Windows Server) to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL\r\nManaged Instance (MI)*\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure *\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nOracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify in scenarios three (3) \u0026\r\nfour (4). \r\nRequired Evidence: The partner must provide evidence for all four (4) of the above following\r\nscenarios, across a minimum of two (2) unique customer projects completed within the past\r\ntwelve (12) months. Each customer case does not have to include all four (4) scenarios, a single\r\nproject may satisfy multiple scenarios. \r\nAssessments may be done manually or through an industry-accepted assessment tool.\r\nAccepted Documentation: Output from Assessment Tools such as: Azure Migrate, Movere, or\r\nother similar Third-party Tooling Reports, Assessment Checklists, Templates, Questionnaires and\r\nProject Plans. "},{"number":21,"complete":false,"content":"21 \r\n3.0 Design\r\nThe partner has robust methodologies for designing the workload.\r\nRequirement\r\n3.1 Solution Design including Azure Landing Zone \r\nThe partner must provide relevant solution design documents that show a consistent approach\r\nto addressing customer requirements that were captured in the Assessment phase.\r\nRequired Evidence:\r\nThe partner must provide solution designs that show a consistent approach to addressing customer\r\nrequirements that were captured from the Assessment phase.\r\nThe partner must provide evidence for two (2) of the four (4) following solution design\r\nscenarios across a minimum of two (2) unique customer projects completed within the past\r\ntwelve (12) months. Each customer case does not have to include all scenarios, a single project\r\nmay satisfy multiple scenarios.\r\n1. Migration of Windows-based applications to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed\r\nInstance (MI)*\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure * \r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nOracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify in scenarios three (3) \u0026 four\r\n(4). \r\nThe solution design must show all of the following:\r\n• A migration design or strategy that outlines which applications, databases, or\r\ndatabase auxiliary components (reporting service, integration service) are in scope\r\nfor the migration.\r\n• An outline of the migration method (rehost, refactor, or replatform) to be used for the\r\napplication, database, database auxiliary components, and so on. It should show how the\r\ndesign addresses the workload dependencies that were demonstrated in the assessment, with\r\nappropriate mitigations.\r\n• The migration risk assessment and risk mitigation. The high-level migration sequence and\r\nestimated time to finish the migration. The validation of the successful migration completion.\r\nAzure landing zone (ALZ): The environment that supports the referenced customer\r\ndeployments should address each of the design areas below required below. If an item is not\r\nrelevant, the partner must document the customer’s decision to deviate from applying best\r\npractices. "},{"number":22,"complete":false,"content":"22 \r\nPresent evidence of:\r\no Implementation of Identity \u0026 Access Management (IAM) and role-based access control\r\n(RBAC), data sovereignty and encryption, application security, and auditing.\r\no Establishing a hub and spoke architecture or retrofitting the existing deployment\r\nto separate out the network components of a hub for optimal performance and\r\nsecurity.\r\no Showing resource and perimeter security, such as bastion hosts, network\r\nsecurity groups and/or Azure Firewall, and/or virtual security and routing\r\nappliances with appropriate monitoring.\r\no Using security products, such as Azure security services, Microsoft 365 security,\r\nMicrosoft Defender for Cloud, or other security solutions, to secure access to\r\nthe data.\r\no Using governance tooling to support cost optimization across the environment.\r\nAfter estimating the initial cost, setting budgets and alerts at different scopes\r\nto proactively monitor the cost.\r\no Using backup and recovery solutions to ensure data retention.\r\no Meeting requirements for government regulatory compliance in the new\r\nenvironment, such as GDPR and HIPAA, and implementing them through\r\nmultiple datacenter regions, as needed.\r\no Implementing a monitoring solution to provide proactive remediation for the\r\nAzure environment, to integrate with the customer\u0027s existing monitoring\r\ntooling, if appropriate.\r\no Showing that visualization and alerting considerations for solutions are in\r\nplace, where appropriate. \r\nAcceptable Documentation: Project Plan, Functional Specifications, Solution Design\r\nDocument, Architectural Diagram, Automated Tooling Reports, and Physical and Logical\r\ndiagrams. "},{"number":23,"complete":false,"content":"23 \r\n3.2 Azure Well-Architected Review of Workloads\r\nThe partner must demonstrate usage of the Azure Well-Architected Review on migrated\r\napplications. The Azure Well-Architected Review is designed to help partners evaluate your\r\ncustomers\u0027 workloads against the latest set of industry best practices. It provides actionable\r\nguidance to design and improve your customers\u0027 workloads. \r\nThe Review can be used to evaluate each workload against the pillars of the Azure Well-\r\nArchitected Framework that matter to that workload.\r\nUnless otherwise specified, Reviews may be conducted before, during, or after deployment. \r\nRequired Evidence: The partner must provide exported results from the completed Well –\r\nArchitected Review. Evidence for all four (4) of the following migration scenarios across a\r\nminimum of two (2) unique customer projects completed within the past twelve (12) months.\r\nEach customer case does not have to include all four (4) scenarios. A single project may\r\nsatisfy multiple scenarios. Please indicate the customer’s name in evidence.\r\n1. Migration of Infra (Windows Server) to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL to Azure (can include Arc-enabled SQL Managed\r\nInstance (MI)*\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure*\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\n• Oracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify in scenarios three\r\n(3) \u0026 four (4).\r\n4.0 Deployment\r\nThe partner has robust methodologies for deploying the workload.\r\nRequirement\r\n4.1 Infrastructure Migration Deployment\r\nThe partner must provide evidence of their ability to migrate infrastructure to a production\r\nenvironment based on customer approved designs, from one (1) of the following Azure\r\nInfrastructure scenarios:\r\n• Move the application from an on-premises Windows/Linux Server to Azure\r\ninfrastructure as a service (IaaS). (*)\r\n• Move the application that is running on Windows Server/Linux from\r\nanother public cloud platform to Azure IaaS. (*) \r\n* Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud "},{"number":24,"complete":false,"content":"24 \r\nFor more information see Azure Arc as a landing zone accelerator. \r\nRequired Evidence: The projects shown for this control must be the same as in Control 3.1\r\nThe partner must provide evidence of their ability to implement an infrastructure migration to a\r\nproduction environment, based on customer-approved designs for a minimum of two (2)\r\nunique customers using one (1) of the above migration scenarios. The documentation must\r\ninclude at least two (2) of the following evidence items for each customer project, totaling\r\nfour (4) evidence artifacts:\r\n• Signed Statements of Work (SOWs) for all projects\r\n• Solution Design Documents for all projects\r\n• The Project Plan and Migration and Deployment sequence\r\n• Architecture Diagrams\r\n• High-level Designs (HLDs) and Low-level Designs (LLDs)\r\n• As-built Documentation\r\n4.2 Database Migrations\r\nThe partner must provide evidence of their ability to migrate databases to Azure with customer\r\napproved designs choosing one (1) of the options for deployment from each of the following\r\ntwo (2) scenario lists.\r\nScenario 1: Migrations to AZURE SQL\r\no Rehosting from SQL Server on-premises or from another public cloud to SQL IaaS on Azure.\r\no Replatforming from SQL Server on-premises or from another public cloud to SQL\r\nplatform as a service (PaaS) on Azure (SQL Database or SQL Managed Instance, or\r\nAzure Arc). *\r\no Replatform from Oracle to Azure SQL IaaS or PaaS.\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nScenario 2: Migrations to Azure Open-Source Databases and Cosmos DB\r\no Replatform Oracle to Azure Database for PostgreSQL\r\no Replatform or rehost PostgreSQL to Azure Database for PostgreSQL*\r\no Replatform or rehost MariaDB to Azure SQL Database for MariaDB\r\no Replatform or rehost MySQL to Azure SQL Database for MySQL\r\no Replatform or rehost Cassandra to Azure Cosmos DB or Azure Managed Instance for\r\nApache Cassandra\r\no Replatform or rehost MongoDB to Azure Cosmos DB\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nRequired Evidence:\r\nThe projects shown for this control must be the same as in Control 3.1. The partner must\r\nprovide evidence of their ability to migrate databases to Azure with customer approved\r\ndesigns, choosing one (1) of the options for deployment from each of the above two (2)\r\nscenario lists for a minimum of two (2) unique customers. To cover the entire sequence,\r\nincluding design and production deployment, the documentation must include at least two\r\n(2) of the following items for each customer project, totaling four (4) evidence artifacts\r\nrequired: "},{"number":25,"complete":false,"content":"25 \r\no Signed Statements of Work (SOWs) for the projects\r\no Solution Design Documents for all projects\r\no The Project Plan with Migration and Deployment sequence\r\no Architecture Diagrams\r\no High-level Designs (HLDs) and Low-level Designs (LLDs)\r\no As built documentation\r\n4.3 Migration Tools\r\nThe partner must demonstrate the specific products, tools, or scripts that were used for the\r\nassessment and migration of customer workloads. The partner must demonstrate the customer\r\naccepted the migration approach by showing confirmation from the customer. \r\nRequired Evidence:\r\nPartners must provide documentation and prove customer migration tool experience with at\r\nleast one (1) of the following options through a demonstration of tools using (A, B, or C):\r\nA. Show experience with using native Azure migration tools by providing a step-by-\r\nstep demonstration that they can effectively use at least four (4) of the following\r\ntools:\r\n• Azure Migrate Server Assessment for VMware and Hyper-V\r\n• Data Migration Assistant (DMA)\r\n• SQL Server Migration Assistant (SSMA)\r\n• Azure Migrate Server Migration VMware and Hyper-V (use of Azure Site Recovery\r\nis also accepted)\r\n• Azure Database Migration Service\r\n• Storage Migration Service\r\nB. Show experience with third-party tools that integrate with Azure Migrate by demonstrating a\r\ncustomer project where assessment data is available from Azure Migrate or available to them\r\noffline and they perform the migration by using third-party tooling.\r\nC. Show experience with all other third-party tools by referencing the tools used in a project plan\r\nfor successfully migrating a customer to Azure, or by providing a spreadsheet with output from\r\nand snapshots of results in an output file from the tools that they used.\r\nTools may include but are not limited to:\r\n• CloudSphere\r\n• Carbonite\r\n• PlateSpin\r\n• CloudEndure\r\n• River Meadow\r\n• Cloudamize\r\n• Zerto\r\n• StratoZone "},{"number":26,"complete":false,"content":"26 \r\n4.4 Automated Deployment and Provisioning Tools\r\nThe partner must demonstrate specific products, tools, or scripts that they used for automated\r\nprovisioning and deprovisioning of infrastructure and database migrations, including tools for\r\ncontinuous integration and continuous delivery (CI/CD). \r\nRequired Evidence:\r\nInclude Demonstrations of Products, Tools, or Scripts used for:\r\n• Automated deployment, including creation of workload deployment templates.\r\n• Cloud service provisioning and deprovisioning, including viewing of service template,\r\npackages, or runbooks that were used in the deployment of customers’ Azure\r\nenvironments.\r\n• Automation of routine operations, or automated scale-out. \r\nThe partner must provide evidence for all four (4) of the Infra and Database Migration\r\ndeployment and provisioning scenarios across a minimum of two (2) unique customer\r\nprojects completed within the past twelve (12) months. Each customer case does not have to\r\ninclude all four (4) scenarios, a single project may satisfy multiple scenarios. "},{"number":27,"complete":false,"content":"27 \r\n5.0 Review and Release for Operations\r\nThe partner has robust methodologies for transitioning the workload.\r\nRequirement\r\n5.1 Service Validation and Testing\r\nThe partner must validate the deployment, including:\r\n• Their documented process and approach to testing and evaluating the performance\r\nof all applications against customers’ expectations and Azure best practices.\r\n• Their documented process and approach to evaluating and improving architectural\r\nbest practices to remediate issues with migrated platforms or workloads that do not\r\nmeet performance or cost expectations. \r\nEvidence can be the same as the projects presented in earlier controls as long as they\r\ndemonstrate the required control definition. \r\nRequired Evidence: The partner must provide evidence for all four (4) of the following service\r\nvalidation and testing scenarios, including validation and performance evaluation across a\r\nminimum of two (2) unique customer projects completed within the past twelve (12) months. \r\nEach customer case does not have to include all four (4) scenarios, a single project may satisfy\r\nmultiple scenarios. The documentation must indicate that the implemented service validation\r\nsolution meets customer expectations, and it must include a sign-off from each customer.\r\n1. Migration of Infra (Windows Server) to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL to Azure (including Arc-enabled SQL MI) *\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure* \r\n• Oracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify in scenarios three (3)\r\n\u0026 four (4).\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud. "},{"number":28,"complete":false,"content":"28 \r\n5.2 Post-deploymentDocumentation\r\nThe partner must provide post-deployment operational documentation to show that their\r\ncustomers are successfully using the new service on Azure. It must:\r\n• Demonstrate how the partner’s documents, decisions, architectural designs, and\r\nprocedures were implemented.\r\n• Demonstrate standard operating procedures for the business-as- usual operations team\r\nthat describe “how to” scenarios.\r\nRequired Evidence:\r\nThe partner must provide operational evidence for all four (4) of the deployment scenarios\r\nacross a minimum of two (2) unique customer projects completed within the past twelve (12)\r\nmonths. Each customer case does not have to include all four (4) scenarios, a single project\r\nmay satisfy multiple scenarios. \r\nThe documentation must indicate that the implemented service validation solution meets\r\ncustomer expectations, and it must include a sign-off from each customer.\r\n1. Migration of Infra (Windows Server) to Azure\r\n2. Migration of Linux-based applications to Azure\r\n3. Migration of Microsoft SQL to Azure (including Arc-enabled SQL MI) *\r\n4. Migration of MySQL, PostgreSQL, MariaDB or MongoDB database to Azure* \r\n• Oracle migration to PostgreSQL, Cosmo DB or Azure SQL will qualify in scenarios three (3)\r\n\u0026 four (4).\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud. \r\nFor pre-qualified partners only, Module B: Alternate audit using Windows and SQL for evidence with\r\nrenewing partners. Microsoft will approve you for this checklist, using telemetry and analysis. This is\r\nnot a self-nomination. Reach out to Azure Partner Specializations azureAS@microsoft.com  to confirm\r\nyour qualification. \r\nAlternate Pathway Audit: Infra \u0026 Database Migration to Azure checklist \r\n1.0 Assess\r\nThe partner must have a consistent approach for assessing customer requirements for the workload.\r\nRequirement "},{"number":29,"complete":false,"content":"29 \r\n1.1 Workload Assessment\r\nThe partner must demonstrate how they assess each workload prior to migration to\r\nensure that adequate pre-migration or pre-deployment planning and sizing were\r\nperformed.\r\nThe assessment must include mapping that shows the dependencies upstream from the resources\r\nthat will be migrated. It must also show:\r\n• The infrastructure, data volumes and database sizes to be migrated.\r\n• The migration timeline and approach.\r\n• The migration risk assessment.\r\n• Backup and disaster recovery for existing workloads.\r\n• Licensing and cost management requirements.\r\n• Documentation of the customer’s existing identity implementation on Azure, gaps\r\nidentification, and best practices recommendations.\r\nThe partner must provide evidence for both of the scenarios below, across a minimum of two (2) unique\r\ncustomer migration projects, completed within the last twelve (12) months. \r\n1. Migration of Windows Server-based applications to Azure\r\n2. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed Instance\r\n(MI) *\r\nNote: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nRequired Evidence: The partner should provide relevant design documents showing that the preceding\r\nitems were reviewed for at least two (2) unique customers with Windows Server Applications and\r\nMicrosoft SQL Server migration projects, completed within the past twelve (12) months. The partner\r\nmust show that all assessment details were considered for these customers. \r\nAssessments may be done manually or through an industry-accepted assessment tool.\r\nAccepted Documentation: Output from Assessment Tools such as: Azure Migrate, Movere, or other\r\nsimilar Third-party Tooling Reports, Assessment Checklists, Templates, Questionnaires and Project\r\nPlans.\r\n2.0 Design\r\nThe partner has robust methodologies for designing the workload.\r\nRequirement\r\n2.1 Solution Design including Azure Landing Zone\r\nThe partner must provide solution designs that show a consistent approach to addressing customer\r\nrequirements that were captured from the Assessment phase.\r\nThe partner must provide evidence for both of the following scenarios across a minimum of two\r\n(2) unique customer projects completed within the last twelve (12) months:\r\n• Migration of Windows Server-based applications to Azure\r\n• Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed\r\nInstance (MI) *\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud. "},{"number":30,"complete":false,"content":"30 \r\nThe partner must provide relevant solution design documents that show a consistent approach to\r\naddressing customer requirements that were captured in the Assessment phase. \r\nThe solution design must show all of the following:\r\n• A migration design or strategy that outlines which applications, databases, or\r\ndatabase auxiliary components (reporting service, integration service) are in scope\r\nfor the migration.\r\n• An outline of the migration method (rehost, refactor, or replatform) to be used for the\r\napplication, database, database auxiliary components, and so on. It should show how the\r\ndesign addresses the workload dependencies that were demonstrated in the assessment, with\r\nappropriate mitigations.\r\n• The migration risk assessment and risk mitigation. The high-level migration sequence and\r\nestimated time to finish the migration. The validation of the successful migration completion. \r\nAzure landing zone (ALZ): The environment that supports the referenced customer\r\ndeployments should address each of the design areas below required below. If an item is not\r\nrelevant, the partner must document the customer’s decision to deviate from applying\r\nbest practices.\r\nPresent evidence of:\r\no Implementation of Identity \u0026 Access Management (IAM) and role-based access control\r\n(RBAC), data sovereignty and encryption, application security, and auditing.\r\no Establishing a hub and spoke architecture or retrofitting the existing deployment to\r\nseparate out the network components of a hub for optimal performance and security.\r\no Showing resource and perimeter security, such as bastion hosts, network\r\nsecurity groups and/or Azure Firewall, and/or virtual security and routing\r\nappliances with appropriate monitoring.\r\no Using security products, such as Azure security services, Microsoft 365 security, Microsoft Defender for Cloud, or other security solutions, to secure access to the data.\r\no Using governance tooling to support cost optimization across the environment.\r\nAfter estimating the initial cost, setting budgets and alerts at different scopes to\r\nproactively monitor the cost.\r\no Using backup and recovery solutions to ensure data retention.\r\no Meeting requirements for government regulatory compliance in the new environment,\r\nsuch as GDPR and HIPAA, and implementing them through multiple datacenter regions, as\r\nneeded.\r\no Implementing a monitoring solution to provide proactive remediation for the Azure\r\nenvironment, to integrate with the customer\u0027s existing monitoring tooling, if appropriate.\r\no Showing that visualization and alerting considerations for solutions are in place, where\r\nappropriate.\r\nAcceptable Documentation: Project Plan, Functional Specifications, Solution Design Document,\r\nArchitectural Diagram, Automated Tooling Reports, and Physical and Logical diagrams. "},{"number":31,"complete":false,"content":"31 \r\n2.2 Azure Well-Architected Review of Workloads\r\nThe partner must demonstrate usage of the Azure Well-Architected Review on migrated\r\napplications. The Azure Well-Architected Review is designed to help partners evaluate your\r\ncustomers\u0027 workloads against the latest set of industry best practices. It provides actionable\r\nguidance to design and improve your customers\u0027 workloads. \r\nThe Review can be used to evaluate each workload against the pillars of the Azure Well-\r\nArchitected Framework that matter to that workload.\r\nUnless otherwise specified, Reviews may be conducted before, during, or after deployment. \r\nRequired Evidence:\r\nThe partner must provide exported results from the completed Well-Architected Review.\r\nEvidence for both of the two (2) following migration scenarios across a minimum of two (2)\r\nunique customer projects completed within the last twelve (12) months. Please indicate the\r\ncustomer’s name in evidence.\r\n1. Migration of Windows Server-based applications to Azure\r\n2. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed\r\nInstance (MI) *\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud.\r\n3.0 Deployment\r\nThe partner has robust methodologies for deploying the workload.\r\nRequirement\r\n3.1 Infrastructure Migration Deployment\r\nThe partner must provide evidence of their ability to implement an infrastructure migration of\r\nWindows Server to a production environment based on customer approved designs, from one\r\n(1) of the following Azure scenarios below:\r\n1. Move the application from an on-premises Windows Server to Azure infrastructure as\r\na service (IaaS). *\r\n2. Move the application that is running on Windows Server from another public cloud\r\nplatform to Azure IaaS. *\r\n* Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud\r\nRequired Evidence: The projects shown for this control must be the same as in Control 2.1. The\r\npartner must provide evidence of their ability to implement a Windows server migration to a\r\nproduction environment from either of the above scenarios, based on customer approved designs,\r\nfor a minimum of two (2) unique customers, completed within the past twelve (12) months. The\r\ndocumentation must cover the entire sequence of the project, including design and production\r\ndeployment, and must include at least two (2) of the following evidence items for each customer\r\nproject, totaling four (4) evidence artifacts:\r\n• Signed Statements of Work (SOWs) for all projects\r\n• Solution Design Documents for all projects\r\n• The Project Plan and Migration and Deployment sequence "},{"number":32,"complete":false,"content":"32 \r\n• Architecture Diagrams\r\n• High-level Designs (HLDs) and Low-level Designs (LLDs)\r\n• As-built Documentation\r\nFor more information see Azure Arc as a landing zone accelerator.\r\n3.2 Database Migrations\r\nThe partner must provide evidence of their ability to implement an SQL Server Database migration\r\nto a production environment, based on customer-approved designs from at least two (2) unique\r\ncustomers, providing evidence for both of the following migration scenarios:\r\nScenario 1\r\n1. Rehosting from SQL Server on-premises or from another public cloud to SQL IaaS on Azure.\r\nScenario 2\r\n2.  Replatforming from SQL Server on-premises or from another public cloud to SQL platform as\r\na service (PaaS) on Azure (SQL Database or SQL Managed Instance). *\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud \r\nRequired Evidence:\r\nThe projects shown for this control must be the same as in Control 2.1. The partner must provide\r\nevidence of their ability to implement an SQL Server Database migration to a production\r\nenvironment, based on customer-approved designs for two (2) unique customers using both\r\nof the above migration scenarios. The documentation must align with the previous solution\r\ndesign requirements. Each of the database migration projects must have been implemented\r\nwithin the past twelve (12) months. To cover the entire sequence, including design and\r\nproduction deployment, the documentation must include at least two (2) of the following\r\nitems for each customer project, totaling four (4) evidence artifacts required:\r\no Signed Statements of Work (SOWs) for the projects\r\no Solution Design Documents for all projects\r\no The Project Plan with Migration and Deployment sequence\r\no Architecture Diagrams\r\no High-level Designs (HLDs) and Low-level Designs (LLDs)\r\no As-built Documentation\r\n3.3 Migration Tools\r\nThe partner must demonstrate the specific products, tools, or scripts that were used for the\r\nassessment and migration of customer workloads. The partner must demonstrate the customer\r\naccepted the migration approach by showing confirmation from the customer. \r\nRequired Evidence:\r\nPartners must provide documentation and prove customer migration tool experience with at\r\nleast one (1) of the following options through a demonstration of tools using (A, B, or C):\r\nA. Show experience with using native Azure migration tools by providing a step-by-\r\nstep demonstration that they can effectively use at least four (4) of the following\r\ntools: "},{"number":33,"complete":false,"content":"33 \r\n• Azure Migrate Server Assessment for VMware and Hyper-V\r\n• Data Migration Assistant (DMA)\r\n• SQL Server Migration Assistant (SSMA)\r\n• Azure Migrate Server migration VMware and Hyper-V (use of Azure Site Recovery is also\r\naccepted)\r\n• Azure Database Migration Service\r\n• Storage Migration Service \r\nB. Show experience with third-party tools that integrate with Azure Migrate by demonstrating a\r\ncustomer project where assessment data is available from Azure Migrate or available to them\r\noffline and they perform the migration by using third-party tooling.\r\nC. Show experience with all other third-party tools by referencing the tools used in a project plan\r\nfor successfully migrating a customer to Azure, or by providing a spreadsheet with output from\r\nand snapshots of results in an output file from the tools that they used.\r\nTools may include but are not limited to:\r\n• CloudSphere\r\n• Carbonite\r\n• PlateSpin\r\n• CloudEndure\r\n• River Meadow\r\n• Cloudamize\r\n• Zerto\r\n• StratoZone\r\n3.4 Automated Deployment and Provisioning Tools\r\nThe partner must demonstrate specific products, tools, or scripts that they used for automated\r\nprovisioning and deprovisioning of infrastructure and database migrations, including tools for\r\ncontinuous integration and continuous delivery (CI/CD). \r\nRequired Evidence:\r\nInclude Demonstrations of Products, Tools, or Scripts used for:\r\n• Automated deployment, including creation of workload deployment templates.\r\n• Cloud service provisioning and deprovisioning, including viewing of service template,\r\npackages, or runbooks that were used in the deployment of customers’ Azure\r\nenvironments.\r\n• Automation of routine operations, or automated scale-out. \r\nThe partner must provide evidence of tools, products, or scripts for either a completed\r\nWindows Server or SQL Server migration project for two (2) unique customer projects\r\ncompleted within the last twelve (12) months. "},{"number":34,"complete":false,"content":"34 \r\n4.0 Review and Release for Operations\r\nThe partner has robust methodologies for transitioning the workload.\r\nRequirement\r\n4.1 Service Validation and Testing\r\nThe partner must validate the deployment, including:\r\n• Their documented process and approach to testing and evaluating the performance\r\nof all applications against customers’ expectations and Azure best practices.\r\n• Their documented process and approach to evaluating and improving architectural best\r\npractices to remediate issues with migrated platforms or workloads that do not meet\r\nperformance or cost expectations. \r\nRequired Evidence: The partner must provide evidence of both of the following service\r\nvalidation and testing scenarios including validation and performance evaluation across a\r\nminimum of two (2) unique customer projects completed within the past twelve (12) months.\r\nThe documentation must indicate that the implemented service validation solution meets\r\ncustomer expectations, and it must include a sign-off from each customer.\r\n1. Migration of Windows Server-based applications to Azure\r\n2. Migration of Microsoft SQL databases to Azure (including Arc-enabled SQL MI) *\r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud. \r\nEvidence can be the same as the projects presented in earlier controls as long as they\r\ndemonstrate the required control definition. "},{"number":35,"complete":false,"content":"35 \r\n4.2 Post-deploymentDocumentation\r\nThe partner must provide post-deployment operational documentation to show that their\r\ncustomers are successfully using the new service on Azure. It must:\r\n• Demonstrate how the partner’s documents, decisions, architectural designs, and\r\nprocedures were implemented.\r\n• Demonstrate standard operating procedures for the business-as-usual\r\noperations team that describe “how to” scenarios.\r\nRequired Evidence:\r\nThe partner must provide evidence for two (2) completed Windows Server and SQL Server\r\nmigration demonstrating both scenarios below across two (2) unique customers completed within\r\nthe past twelve (12) months.\r\n1. Migration of Windows Server-based applications to Azure\r\n2. Migration of Microsoft SQL databases to Azure (can include Arc-enabled SQL Managed\r\nInstance (MI) * \r\n*Note: Azure includes Microsoft datacenters, Arc enabled Azure on-prem or Arc enabled multi-cloud. "},{"number":36,"complete":false,"content":"36 \r\nAzure Specializations Partner FAQ \r\nQuestions regarding the Azure Partner program specializations, the current checklists and pre-\r\nqualifications for partners can usually be answered by visiting Microsoft Azure Partner Specializations \r\nQuestions on the audit checklists and program can be sent to the Azure Partner Specializations help alias.\r\n\u003Cmailto:AzureAS@microsoft.com\u003E \r\nIf you have questions that have not been answered, please go to Partner Center support to create a ticket\r\nwith our Frontline team. "}],"mimeType":"text/plain"}